OscillatingMeshCase/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    Wing-Bottom
    {
        type            zeroGradient;
    }
    Wing-Top
    {
        type            zeroGradient;
    }
    Inlet
    {
        type            zeroGradient;
    }
    Outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    TopBottom
    {
        type            zeroGradient;
    }
    Top
    {
        type            empty;
    }
    Base
    {
        type            empty;
    }
    AMI0
    {
        type            cyclicAMI;
        value           $internalField;
    }
    AMI1
    {
        type            cyclicAMI;
        value           $internalField;
    }








}

// ************************************************************************* //
